nose-case/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2306                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

scale 1000;

vertices
(    (-3.31 3.25 -3.45) 
     (-3.31 -0.35 -3.45)
     (-3.31 3.25 3.58)
     (3.31 3.25 3.58)
     (-3.31 3.25 3.58)
     (-3.31 -0.35 3.58) 
     (3.31 -0.35 3.58) 
     (3.31 3.25 3.58) 

    
          
  
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (70 70 70) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    left
    {
        type patch;
        faces
        (
            (3 7 6 2)
        );
    }
    right
    {
        type patch;
        faces
        (
            (1 5 4 0)
        );
    }
    back
    {
        type patch;
        faces
        (
            (0 4 7 3)
        );
    }
    front
    {
        type patch;
        faces
        (
            (2 6 5 1)
        );
    }
    bottom
    {
        type wall;
        faces
        (
            (4 5 6 7)
        );
    }
    top
        {
        type patch;
        faces
        (
            (0 3 2 1)
        );
    }
);


// ************************************************************************* //
